#+TITLE: SICP Exercises 
#+AUTHOR: Christopher Findeisen
#+OPTIONS: texht:t
#+LATEX_CLASS: article
#+DATE: \today

* Intro
In order to run this code in emacs, you should run this elisp
#+begin_src emacs-lisp :tangle yes
  (add-to-list 'org-src-lang-modes '("scheme" . scheme) )
  (add-to-list 'org-babel-load-languages '(scheme . t))
  (org-babel-do-load-languages 'org-babel-load-languages '((emacs-lisp . t) (scheme . t) ))
#+end_src

#+RESULTS:
: ((emacs-lisp . t) (scheme . t))

** DONE Exercise 1.3.
CLOSED: [2016-11-28 Mon 12:47]
Define a procedure that takes three numbers as arguments and returns the sum of the squares of the two larger numbers.
#+begin_src scheme :tangle yes 
(define (square x) (* x x))
(define (largest x y)
  (if (> x y)
      x
      y))

(define (sum-of-squares n1 n2 n3)
  (let (
        (n1 (largest n1 n2))
        (n2 (largest n2 n3)))
    (+ (square n1) (square n2))
    )
  )
(sum-of-squares 2 3 4)
#+end_src

#+RESULTS:
: 25

** DONE Exercise 1.4.
CLOSED: [2016-11-28 Mon 12:47]
Observe that our model of evaluation allows for combinations whose operators are compound expressions. Use this observation to describe the behavior of the following procedure:
#+begin_src scheme :tangle yes
(define (a-plus-abs-b a b)
  ((if (> b 0) + -) a b))

(a-plus-abs-b 9 -1)
#+end_src

#+RESULTS:
: 10

;; Expected result: 
10

** DONE Exercise 1.11.
CLOSED: [2016-11-28 Mon 12:46]
  A function f is defined by the rule that f(n) = n if n<3 and f(n) = f(n - 1) + 2f(n - 2) + 3f(n - 3) if n>= 3. Write a procedure that computes f by means of a recursive process. Write a procedure that computes f by means of an iterative process.

f(4) = 3 + 2 + 1
f(5) = 6 + 3 + 2

#+begin_src scheme :tangle yes
(define (f n)
  (define (f-iter current n-1 n-2 n-3 up-to)
    (if (> current up-to)
        n-1
        (f-iter (+ current 1) (+ n-1 n-2 n-3) n-1 n-2 up-to)))

  (cond ((< n 3) n)
        ((>= n 3) (f-iter 4 3 2 1 n) )))
(f 7)
#+end_src

#+RESULTS:
: 68

** DONE Exercise 1.12.
CLOSED: [2016-11-28 Mon 13:54]
  The following pattern of numbers is called Pascal's triangle.

      1 
     1 1
    1 2 1
  1 3 3 1
 1 4 6 4 1
...........

p(5, 4) = p(4,3) + p(4, 4) 
p(5, 2) = p(4,1) + p(4, 2) 
p(5,1) = p(4,1)
p(5,5) = p(4,5)

The numbers at the edge of the triangle are all 1, and each number inside the triangle is the sum of the two numbers above it.35 Write a procedure that computes elements of Pascal's triangle by means of a recursive process.

#+begin_src scheme :tangle yes
  ;;assumes valid input
  (define (pascals-triangle row n-from-l)
    ;(define op (if
    ;(= (remainder n-from-l 2) 0)  + -))
    (cond  ((and (= row 1) (= n-from-l 1)) 1)
          ((< n-from-l 1) 0) ; left of first triangular value
          ((> n-from-l row) 0) ; right of last triangular value
          (else (+ (pascals-triangle (- row 1 ) n-from-l) (pascals-triangle (- row 1) (- n-from-l 1))))
          )
          )

  (pascals-triangle 5 2)
    #+end_src

#+RESULTS:
: 4

** DONE Exercise 1.16.
CLOSED: [2016-11-28 Mon 15:24]
Design a procedure that evolves an iterative exponentiation process that uses successive squaring and uses a logarithmic number of steps, as does fast-expt. (Hint: Using the observation that b^(n/2)^2 = (b^2)^n/2, keep, along with the exponent n and the base b, an additional state variable a, and define the state transformation in such a way that the product a*b^n is unchanged from state to state. At the beginning of the process a is taken to be 1, and the answer is given by the value of a at the end of the process. In general, the technique of defining an invariant quantity that remains unchanged from state to state is a powerful way to think about the design of iterative algorithms.)
#+begin_src scheme :tangle yes
;; useful for checking whether our function is indeed logarithmic
(define (display-and-return disp ret)
  (display "number of multiplications- ")
  (display disp)
  (display "\n")
  ret) 

  (define (fast-exp base exp)
    (define (iter-exp base exp a steps)
      (cond
      ((= exp 0) (display-and-return steps a))
      ((even? exp) (iter-exp (* base  base) (/ exp 2) a (+ steps 1)))
      (else (iter-exp base (- exp 1) (* a base) (+ steps 1)))
      )
      )
    (iter-exp base exp 1 0))
(fast-exp 2 8)
#+end_src

#+RESULTS:
: 256

** DONE Exercise 1.17.
CLOSED: [2016-11-28 Mon 15:42]
The exponentiation algorithms in this section are based on performing exponentiation by means of repeated multiplication. In a similar way, one can perform integer multiplication by means of repeated addition. The following multiplication procedure (in which it is assumed that our language can only add, not multiply) is analogous to the expt procedure:

(define (* a b)
(if (= b 0)
0
(+ a (* a (- b 1)))))

This algorithm takes a number of steps that is linear in b. Now suppose we include, together with addition, operations double, which doubles an integer, and halve, which divides an (even) integer by 2. Using these, design a multiplication procedure analogous to fast-expt that uses a logarithmic number of steps.

#+begin_src scheme :tangle yes
  (define (* a b)
    (define (double val) (+ val val))
    (define (halve val) (/ val 2))
    (cond
    ((= b 0) 0)
    ((even? b) (* (double a) (halve b)))
    (else (+ a (* a (- b 1))))
    )
    )
  (* 4 1000)
#+end_src

#+RESULTS:
: 4000

** DONE Exercise 1.19.
CLOSED: [2016-11-28 Mon 17:08]
There is a clever algorithm for computing the Fibonacci numbers in a logarithmic number of steps. Recall the transformation of the state variables a and b in the fib-iter process of section 1.2.2: a <- a + b and b <- a. Call this transformation T, and observe that applying T over and over again n times, starting with 1 and 0, produces the pair Fib(n + 1) and Fib(n). In other words, the Fibonacci numbers are produced by applying T(n), the nth power of the transformation T, starting with the pair (1,0). Now consider T to be the special case of p = 0 and q = 1 in a family of transformations T_pq, where T_pq transforms the pair (a,b) according to a <- b*q + a*q + a*p and b <- b*p + a*q. 

Show that if we apply such a transformation T_pq twice, the effect is the same as using a single transformation T_p'q' of the same form, and compute p' and q' in terms of p and q. This gives us an explicit way to square these transformations, and thus we can compute T_n using successive squaring, as in the fast-expt procedure. Put this all together to complete the following procedure, which runs in a logarithmic number of steps

Ta = (b*q + a*q + a*p) 
Tb = (b*p + a*q)

TTa = (b*p + a*q)*q + (b*q + a*q + a*p)*q + (b*q + a*q + a*p)*p 
TTa = 2b*p*q + 2a*q^2 + b*q^2 + 2a*q*p + a*p^2 
TTa = b(2pq + q^2) + a(2qp + 2q^2 + p^2)

TTb = b*p^2 + a*q*p + b*q^2 + a*q^2 + a*p*q
TTb = b(p^2 + q^2) + a(q^2 + 2pq)

Looking at these forms, where
a <- b(q') + a(q'+p')
and 
b <- b(p') + a(q'), it's easy to see that the values of p' and q' are:

p' = p^2 + q^2
q' = q^2 + 2pq

#+begin_src scheme :tangle yes 
(define (square x) (* x x))
(define (fib n)
(fib-iter 1 0 0 1 n))

(define (fib-iter a b p q count)
(cond ((= count 0) b)
((even? count)
(fib-iter a
b
(+ (square p) (square q))     ; compute p'       
(+ (square q) (* 2 p q))      ; compute q'
(/ count 2)))
(else (fib-iter (+ (* b q) (* a q) (* a p))
(+ (* b p) (* a q))
p
q
(- count 1)))))
(fib 7)
#+end_src

#+RESULTS:
: 13

** DONE Exercise 1.29.
CLOSED: [2016-11-28 Mon 17:57]
Simpson's Rule is a more accurate method of numerical integration than the method illustrated above. Using Simpson's Rule, the integral of a function f between a and b is approximated as


where h = (b - a)/n, for some even integer n, and yk = f(a + kh). (Increasing n increases the accuracy of the approximation.) Define a procedure that takes as arguments f, a, b, and n and returns the value of the integral, computed using Simpson's Rule. Use your procedure to integrate cube between 0 and 1 (with n = 100 and n = 1000), and compare the results to those of the integral procedure shown above.

#+begin_src scheme :tangle yes
  (define (cube x) (* x x x))
  (define (simpson-integration func a b n)
    (define (simpson-rec func a b n k)
      (let ((h
            (/ (- b a )n))
            (coeff (cond
                    ((or (= k 0) (= k n)) 1)
                    ((even? k) 2)
                    (else 4)
                    ))
            )
        (if (= k n)
            (* coeff (func (+ a (* k h))) )
            ( + (* coeff (func (+ a (* k h))) ) (simpson-rec func a b n (+ k 1)))
            )
        )
      )
    (* (/ (/ (- b a ) n) 3) (simpson-rec func a b n 0))
    )
  (simpson-integration cube 0.0 1 100.0)
#+end_src

#+RESULTS:
: 0.24999999999999992

** DONE Exercise 1.30.
CLOSED: [2016-11-28 Mon 18:33]
The sum procedure above generates a linear recursion. The procedure can be rewritten so that the sum is performed iteratively. Show how to do this by filling in the missing expressions in the following definition:

// should yield 3025
(sum cube 1 inc 10) 



#+begin_src scheme :tangle yes 
  (define (cube x) (* x x x))
  (define (inc x) (+ x 1))
  (define (sum term a next b)
    (define (iter a result)
      (if (> a b)
          result
          (iter (next a) (+ (term a) result))))
    (iter a 0))
  (sum cube 1 inc 10) 
#+end_src

#+RESULTS:
: 3025

*** a) Recursive
An infinite continued fraction is an expression of the form
f = ( N_1 / (D_1 + N2 / ( D2 + N3 / (D3 + ... 
As an example, one can show that the infinite continued fraction expansion with the N_i and the D_i all equal to 1 produces 1/\, where  is the golden ratio (described in section 1.2.2). One way to approximate an infinite continued fraction is to truncate the expansion after a given number of terms. Such a truncation -- a so-called k-term finite continued fraction -- has the form

Suppose that n and d are procedures of one argument (the term index i) that return the Ni and Di of the terms of the continued fraction. Define a procedure cont-frac such that evaluating (cont-frac n d k) computes the value of the k-term finite continued fraction. Check your procedure by approximating 1 / \phi using

(cont-frac (lambda (i) 1.0)
(lambda (i) 1.0)
k)

for successive values of k. How large must you make k in order to get an approximation that is accurate to 4 decimal places?

Answer: 10

#+begin_src scheme :tangle yes
  (define (cont-frac N-func D-func k)
    (define (cont-frac-rec i)
      (if (= i k)
          (/ (N-func i) (D-func i))
          (/ (N-func i) (+ (D-func i) (cont-frac-rec (+ i 1))))
          )
    )
    (cont-frac-rec 1)
    )

  ;; should yield golden ratio
  (cont-frac (lambda (i) 1.0)
  (lambda (i) 1.0)
  11)
#+end_src
#+RESULTS:
: 0.6180555555555556

*** b) Iterative
If your cont-frac procedure generates a recursive process, write one that generates an iterative process. If it generates an iterative process, write one that generates a recursive process.

#+begin_src scheme :tangle yes
  (define (cont-frac N-func D-func k)
    (define (cont-frac-iter i denominator)
      (cond ((= i 0) denominator)
            ((= i k)
            (cont-frac-iter
              (- i 1)
              (/ (N-func i) (D-func i))))
            (else
            (cont-frac-iter
              (- i 1)
              (/ (N-func i)
              (+ (D-func i) denominator))))
            )
            )
      (cont-frac-iter k 0)
      )

    ;; should yield golden ratio
    (cont-frac (lambda (i) 1.0)
              (lambda (i) 1.0)
              11)
#+end_src
#+RESULTS:
: 0.6180555555555556

** DONE Exercise 1.42.
CLOSED: [2016-11-28 Mon 20:31]
Let f and g be two one-argument functions. The composition f after g is defined to be the function x -> f(g(x)). Define a procedure compose that implements composition. For example, if inc is a procedure that adds 1 to its argument,

#+begin_src scheme :tangle yes
;; expected result:  49
(define (inc x) (+ x 1))
(define (square x) (* x x))
(define (compose f g) 
(lambda (x) (f (g x)))
)
((compose square inc) 6)
#+end_src

#+RESULTS:
: 49

** DONE Exercise 1.46.
CLOSED: [2016-11-28 Mon 21:28]
Several of the numerical methods described in this chapter are instances of an extremely general computational strategy known as iterative improvement. Iterative improvement says that, to compute something, we start with an initial guess for the answer, test if the guess is good enough, and otherwise improve the guess and continue the process using the improved guess as the new guess. Write a procedure iterative-improve that takes two procedures as arguments: a method for telling whether a guess is good enough and a method for improving a guess. Iterative-improve should return as its value a procedure that takes a guess as argument and keeps improving the guess until it is good enough. Rewrite the sqrt procedure of section 1.1.7 and the fixed-point procedure of section 1.3.3 in terms of iterative-improve.

#+begin_src scheme :tangle yes 
(define (iterative-improve close-enough-func improve-func)
  (define (iterative-improve-filled guess x)
    (if (close-enough-func guess x)
        guess
        (iterative-improve-filled (improve-func guess x) x)
        )
    )
  iterative-improve-filled
  )

(define (square x) (* x x))

; pulled from sicp
(define (good-enough? guess x)
  (< (abs (- (square guess) x)) 0.001))

(define (sqrt-improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))

(define tolerance 0.00001)

(define (fp-close-enough? guess f)
  (< (abs (- guess (f guess))) tolerance))

(define (fp-improve guess f)
  (f guess))

(define (fixed-point f first-guess)
  ((iterative-improve fp-close-enough? fp-improve) first-guess f))

(define (sqrt x)
  ((iterative-improve good-enough? sqrt-improve) 1.0 x))

(sqrt 4)
(fixed-point cos 1.0)
  #+end_src

#+RESULTS:
: 0.7390893414033927




** DONE Exercise 2.6.  
   CLOSED: [2016-11-30 Wed 12:42]
In case representing pairs as procedures wasn't mind-boggling enough, consider that, in a language that can manipulate procedures, we can get by without numbers (at least insofar as nonnegative integers are concerned) by implementing 0 and the operation of adding 1 as

//see add-1 and zero below

This representation is known as Church numerals, after its inventor, Alonzo Church, the logician who invented the  calculus.

Define one and two directly (not in terms of zero and add-1). (Hint: Use substitution to evaluate (add-1 zero)). Give a direct definition of the addition procedure + (not in terms of repeated application of add-1).



(define (add-1 zero)
  (lambda (f) (lambda (x) (f ((zero f) x)))))
  

->  (lambda (f) (lambda (x) (f x)))




#+begin_src scheme :tangle yes
;; Church Numerals
(define zero (lambda (f) (lambda (x) x)))

(define (one f) (lambda (x) (f x)))
(define (two f) (lambda (x) (f (f x))))

(define (add-church n1 n2) (lambda (f) (lambda (x) ((n1 f) ((n2 f) x)))))

(define (add-1 n)
  (lambda (f) (lambda (x) (f ((n f) x)))))


;;helper fns pulled from online for checking solutions

 ;; Recursive process 
 (define (int->church n) 
   (if (= n 0) 
       zero 
       (add-1 (int->church (- n 1))))) 
  
 (define (church->int cn) 
   ((cn (lambda (n) (+ n 1))) 0)) 

; test 
(church->int (add-1(add-church two two)))
(church->int two)
(church->int one)
(church->int zero)
#+end_src

#+RESULTS:
: 0


*** DONE Exercise 2.9.
    CLOSED: [2016-11-30 Wed 19:44]
The width of an interval is half of the difference between its upper and lower bounds. The width is a measure of the uncertainty of the number specified by the interval. For some arithmetic operations the width of the result of combining two intervals is a function only of the widths of the argument intervals, whereas for others the width of the combination is not a function of the widths of the argument intervals. Show that the width of the sum (or difference) of two intervals is a function only of the widths of the intervals being added (or subtracted). Give examples to show that this is not true for multiplication or division.
#+begin_src scheme :tangle yes
(define (make-interval a b) (cons a b))

(define (lower-bound interval)(min ( car interval ) (cdr interval)))
(define (upper-bound interval)(max ( car interval ) (cdr interval)))

(define (width interval)
(- (upper-bound interval) (lower-bound interval)))

;; Expected result:  9
(width (make-interval 1 10))
#+end_src

#+RESULTS:
: 9

*** DONE Exercise 2.10.
    CLOSED: [2016-11-30 Wed 20:03]
Ben Bitdiddle, an expert systems programmer, looks over Alyssa's shoulder and comments that it is not clear what it means to divide by an interval that spans zero. Modify Alyssa's code to check for this condition and to signal an error if it occurs.

#+begin_src scheme :tangle yes
(define (mul-interval x y)
  (let ((p1 (* (lower-bound x) (lower-bound y)))
        (p2 (* (lower-bound x) (upper-bound y)))
        (p3 (* (upper-bound x) (lower-bound y)))
        (p4 (* (upper-bound x) (upper-bound y))))
    (make-interval (min p1 p2 p3 p4)
                   (max p1 p2 p3 p4))))

  (define (make-interval a b) (cons a b))
  (define (lower-bound interval)(min ( car interval ) (cdr interval)))
  (define (upper-bound interval)(max ( car interval ) (cdr interval)))
  (define (div-interval x y)
    (if (or (= (upper-bound y) 0) (= (lower-bound y) 0)
            ) (error "Cannot divide interval that spans 0")
        (mul-interval x
                      (make-interval (/ 1.0 (upper-bound y))
                                     (/ 1.0 (lower-bound y)))))
    )

  (div-interval (make-interval 2 1) (make-interval 1 1))
#+end_src

#+RESULTS:
: (1.0 . 2.0)

*** DONE Exercise 2.12.
    CLOSED: [2016-11-30 Wed 21:54]
After debugging her program, Alyssa shows it to a potential user, who complains that her program solves the wrong problem. He wants a program that can deal with numbers represented as a center value and an additive tolerance; for example, he wants to work with intervals such as 3.5± 0.15 rather than [3.35, 3.65]. Alyssa returns to her desk and fixes this problem by supplying an alternate constructor and alternate selectors:

Unfortunately, most of Alyssa's users are engineers. Real engineering situations usually involve measurements with only a small uncertainty, measured as the ratio of the width of the interval to the midpoint of the interval. Engineers usually specify percentage tolerances on the parameters of devices, as in the resistor specifications given earlier.

Define a constructor make-center-percent that takes a center and a percentage tolerance and produces the desired interval. You must also define a selector percent that produces the percentage tolerance for a given interval. The center selector is the same as the one shown above.
#+begin_src scheme :tangle yes
  (define (make-interval a b) (cons a b))
  (define (lower-bound interval)(min ( car interval ) (cdr interval)))
  (define (upper-bound interval)(max ( car interval ) (cdr interval)))
  (define (make-center-percent c p)
    (make-interval (- c (* c p)) (+ c (* c p))))
  (define (center i)
    (/ (+ (lower-bound i) (upper-bound i)) 2))
  (define (width i)
    (/ (- (upper-bound i) (lower-bound i)) 2))

  ;; Expected result:
  (width (make-center-percent 2 2))
#+end_src

#+RESULTS:
: 4

** DONE Exercise 2.17.
   CLOSED: [2016-11-29 Tue 22:23]
   Define a procedure last-pair that returns the list that contains only the last element of a given (nonempty) list:
   
#+begin_src scheme :tangle yes 
  (define (last-pair n)
  (cond ((null? n ) '())
         ((null? (cdr n)) n)
         (else (last-pair (cdr n)))
         )
  )
  ;; Expected result: (34)
  (last-pair (list 23 72 149 34))
#+end_src

#+RESULTS:
: (34)

*** Answer 
#+begin_src scheme :tangle yes
(car (cdr (car ( cdr ( cdr 
'(1 3 (5 7) 9)
)))))

(car(car
' ((7))
))

(car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr
'(1 (2 (3 (4 (5 (6 7))))))
))))))))))))
#+end_src

#+RESULTS:
: 7

** DONE Exercise 2.54.
   CLOSED: [2016-11-30 Wed 00:08]
Two lists are said to be equal? if they contain equal elements arranged in the same order. For example,

(equal? '(this is a list) '(this is a list))

is true, but

(equal? '(this is a list) '(this (is a) list))

is false. To be more precise, we can define equal? recursively in terms of the basic eq? equality of symbols by saying that a and b are equal? if they are both symbols and the symbols are eq?, or if they are both lists such that (car a) is equal? to (car b) and (cdr a) is equal? to (cdr b). Using this idea, implement equal? as a procedure.

#+begin_src scheme :tangle yes
  (define (equal? x y) 
  (cond ((and (symbol? x) (symbol? y))
         (eq? x y))
        ((and (null? x) (null? y)) 
         #t)
        ((and (list? x) (list? y) (not (null? x)) (not (null? y)))
              (and (equal? (car x) (car y)) (equal? (cdr x) (cdr y))))
        (else #f)
        ))

  ;; Expected result: #t
  (equal? '(this is a list) '(this is a list))
  ;; Expected result: #f
  (equal? '(this is a list) '(this (is a) list))
#+end_src

#+RESULTS:
: #f

